<h1 align=center><font size = 5>Lab07</font></h1>
<h1 align=center><font size = 4>Pandas </font></h1>

In [2]:
import pandas as pd

In [3]:
my_dict = {"country": ["Brazil", "Russia", "India", "China", "South Africa"],
           "capital": ["Brasilia", "Moscow", "New Dehli", "Beijing", "Pretoria"],
           "area": [8.516, 17.10, 3.286, 9.597, 1.221],
           "population": [200.4, 143.5, 1252, 1357, 52.98]}

**1- Create a DataFrame called `df` from the above dictionary**

In [4]:
dataframe = pd.DataFrame(my_dict)

dataframe.head()

        country    capital    area  population
0        Brazil   Brasilia   8.516      200.40
1        Russia     Moscow  17.100      143.50
2         India  New Dehli   3.286     1252.00
3         China    Beijing   9.597     1357.00
4  South Africa   Pretoria   1.221       52.98

**2- Set the index for `df` - ["BR", "RU", "IN", "CH", "SA"]**

In [5]:
country_code = ["BR", "RU", "IN", "CH", "SA"]
dataframe["country_code"] = country_code

dataframe.set_index('country_code', inplace=True)

dataframe

                   country    capital    area  population
country_code
BR                  Brazil   Brasilia   8.516      200.40
RU                  Russia     Moscow  17.100      143.50
IN                   India  New Dehli   3.286     1252.00
CH                   China    Beijing   9.597     1357.00
SA            South Africa   Pretoria   1.221       52.98

**3- Print out country column as Pandas Series**

In [6]:
dataframe.country

country_code
BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

**4- Print out country column as data frame**

In [7]:
dataframe[['country']]

                   country
country_code
BR                  Brazil
RU                  Russia
IN                   India
CH                   China
SA            South Africa

**5- Print out a DataFrame with country and area columns**

In [8]:
dataframe[['country', 'area']]

                   country    area
country_code
BR                  Brazil   8.516
RU                  Russia  17.100
IN                   India   3.286
CH                   China   9.597
SA            South Africa   1.221

**6- Print out the first 4 observations**

In [9]:
dataframe.iloc[0:4]

             country    capital    area  population
country_code
BR            Brazil   Brasilia   8.516       200.4
RU            Russia     Moscow  17.100       143.5
IN             India  New Dehli   3.286      1252.0
CH             China    Beijing   9.597      1357.0

**7- Print out fourth and fifth observations**

In [10]:
dataframe.iloc[3:5]

                   country   capital   area  population
country_code
CH                   China   Beijing  9.597     1357.00
SA            South Africa  Pretoria  1.221       52.98

**8- Print out observation (row) for India**

In [11]:
dataframe.loc['IN']

country           India
capital       New Dehli
area              3.286
population       1252.0
Name: IN, dtype: object

**9- Get the area and population of china and India**

In [12]:
dataframe.loc[['IN', 'CH']][['area', 'population']]

               area  population
country_code
IN            3.286      1252.0
CH            9.597      1357.0

**10 - Read Grades.csv file into the pandas data frame and answer the following question:**
- Using the head method returns the first five rows
- Print out the column names
- Print out the row names as a list
- Get the dimensions of the data frame with shape
- Get the data type of each column
- Look at how many unique grades exist
- Get the mean, min, max of all the numeric values
- Find the average of the final grade for each Grade category
- How many students got the Grade as "A"?
- Find the name of the student with the highest final grade

In [13]:
grades_df = pd.read_csv('Grades.csv')

grades_df.head()

,Name,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final,Grade
0,Jake,32,1,19.5,20,1,10.0,33.0,A
1,Joe,32,1,20.0,16,1,14.0,32.0,A
2,Susan,30,1,19.0,19,1,10.5,33.0,A-
3,Sol,31,1,22.0,13,1,13.0,34.0,A
4,Chris,30,1,19.0,17,1,12.5,33.5,A

In [14]:
for col in grades_df.columns:
    print(col)

Name
Previous_Part
Participation1
Mini_Exam1
Mini_Exam2
Participation2
Mini_Exam3
Final
Grade

In [15]:
list(grades_df.index)

[0, 1, 2, 3, 4]

In [16]:
grades_df.shape

(5, 9)

In [17]:
grades_df.dtypes

Name               object
Previous_Part       int64
Participation1      int64
Mini_Exam1        float64
Mini_Exam2          int64
Participation2      int64
Mini_Exam3        float64
Final             float64
Grade              object
dtype: object

In [18]:
grades_df['Grade'].unique()

array(['A', 'A-'], dtype=object)

In [19]:
num_grades_df = grades_df.select_dtypes(include='number')

num_grades_df.describe()

,Previous_Part,Participation1,Mini_Exam1,Mini_Exam2,Participation2,Mini_Exam3,Final
count,5.0,5.0,5.00000,5.000000,5.0,5.000000,5.00000
mean,31.0,1.0,19.90000,17.000000,1.0,12.000000,33.10000
std,1.0,0.0,1.24499,2.738613,0.0,1.695582,0.74162
min,30.0,1.0,19.00000,13.000000,1.0,10.000000,32.00000
25%,30.0,1.0,19.00000,16.000000,1.0,10.500000,33.00000
50%,31.0,1.0,19.50000,17.000000,1.0,12.500000,33.00000
75%,32.0,1.0,20.00000,19.000000,1.0,13.000000,33.50000
max,32.0,1.0,22.00000,20.000000,1.0,14.000000,34.00000

In [25]:
grades_df.groupby('Grade')['Final'].mean()

Grade
A     33.125
A-    33.000
Name: Final, dtype: float64

In [ ]:
len(grades_df[grades_df['Grade'] == 'A'])

In [ ]:
grades_df[grades_df['Final'] == grades_df['Final'].max()]['Name']